{
  "backend/main.mo": "Motoko canister implementing worker CRUD, attendance recording by date, monthly attendance queries, and per‑principal passcode storage.",
  "feature_evidence.json": "Feature evidence report listing two frontend attendance‑selector fixes with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Mapping of frontend file paths to short functional descriptions covering pages, components, hooks, utils, and styles.",
  "frontend/index.css": "Tailwind base styles and custom OKLCH color tokens for light/dark themes with global background and typography rules.",
  "frontend/index.html": "Minimal HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router, app layout with navigation, lock‑screen gating, footer, and toast provider.",
  "frontend/src/components/AttendanceCellSelector.tsx": "Dialog for selecting attendance status that calls setAttendance and shows status‑specific toast messages.",
  "frontend/src/components/AttendanceGrid.tsx": "Monthly attendance table rendering workers vs. days with color‑coded cells and a selector dialog for marking attendance.",
  "frontend/src/components/MonthlyWorkerSummary.tsx": "Displays a table summarizing each worker’s attendance and payroll for a given month using attendance data and payroll calculation.",
  "frontend/src/components/MonthSidebar.tsx": "Sidebar UI to select year and month with navigation buttons and dropdowns, updating parent via callbacks.",
  "frontend/src/components/TopNav.tsx": "Renders the top navigation bar with links, icons, and active-state highlighting.",
  "frontend/src/components/WorkerFormDialog.tsx": "Modal form for creating or editing a worker, handling validation, saving, and toast notifications.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useAppLock.ts": "Manages passcode-based app locking using the backend actor and localStorage state.",
  "frontend/src/hooks/useAttendance.ts": "Provides attendance fetching, setting, clearing, and per-worker attendance mapping for a given month.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, loading identities, handling login/logout, and exposing identity state.",
  "frontend/src/hooks/usePayrollCalculator.ts": "React hook that fetches attendance in a date range and calculates payroll totals for a worker.",
  "frontend/src/hooks/useWorkers.ts": "Provides React Query hooks to load, create, update, and delete workers with backend integration.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables, dark mode styles, and attendance color utilities.",
  "frontend/src/main.tsx": "Application entry point that initializes React Query and Internet Identity context before rendering App.",
  "frontend/src/pages/CalculatorPage.tsx": "UI for selecting a worker and date range to compute wages using payroll calculator hooks.",
  "frontend/src/pages/CalendarPage.tsx": "Attendance calendar page showing monthly grids and worker summaries with selectable month and year.",
  "frontend/src/pages/HomePage.tsx": "Landing page with navigation cards for calendar, worker management, and a quick attendance guide.",
  "frontend/src/pages/LockScreenPage.tsx": "Lock screen requiring a passcode to unlock the app, using useAppLock and toast feedback.",
  "frontend/src/pages/SettingsPage.tsx": "UI page for enabling app lock, managing passcodes, and showing a passcode setup dialog with validation and toast feedback.",
  "frontend/src/pages/WorkersPage.tsx": "Displays and manages the worker list, including add, edit, and delete actions with dialogs and loading states.",
  "frontend/src/utils/dateRange.ts": "Utility functions for listing months between dates, formatting dates, and parsing date strings.",
  "frontend/src/utils/payroll.ts": "Calculates payroll totals from attendance records using full, half, and morning-evening day rules and daily wage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing app purpose, architecture notes, known issues, and implemented feature requirements."
}